In [3]:
people = {
    "first_name" : ["Samir", "Sabina", "Devlal", "Sabin"],
    "last_name" : ["Shrestha", "Maharjan", "Thechmi", "Maharjan"],
    "address" : ["Anamnagar", "Baniyatar", "Ghattekulo", "Manamaiju"]
    
}

In [5]:
people["first_name"]

['Samir', 'Sabina', 'Devlal', 'Sabin']

In [6]:
people['address']

['Anamnagar', 'Baniyatar', 'Ghattekulo', 'Manamaiju']

In [7]:
import pandas as pd

In [8]:
df = pd.DataFrame(people)

In [9]:
df

  first_name last_name     address
0      Samir  Shrestha   Anamnagar
1     Sabina  Maharjan   Baniyatar
2     Devlal   Thechmi  Ghattekulo
3      Sabin  Maharjan   Manamaiju

In [14]:
df["address"]

0     Anamnagar
1     Baniyatar
2    Ghattekulo
3     Manamaiju
Name: address, dtype: object

In [17]:
df.address

0     Anamnagar
1     Baniyatar
2    Ghattekulo
3     Manamaiju
Name: address, dtype: object

In [16]:
type(df["address"])

pandas.core.series.Series

In [19]:
df[["last_name", "address"]]

  last_name     address
0  Shrestha   Anamnagar
1  Maharjan   Baniyatar
2   Thechmi  Ghattekulo
3  Maharjan   Manamaiju

In [28]:
df.columns

Index(['first_name', 'last_name', 'address'], dtype='object')

In [32]:
# integer location 
df.iloc[1]

first_name       Sabina
last_name      Maharjan
address       Baniyatar
Name: 1, dtype: object

In [38]:
df.iloc[[2, 3]]

  first_name last_name     address
2     Devlal   Thechmi  Ghattekulo
3      Sabin  Maharjan   Manamaiju

In [44]:
df.iloc[[1, 3], [0, 2]]

  first_name    address
1     Sabina  Baniyatar
3      Sabin  Manamaiju

In [45]:
df.iloc[[1,3], 2]

1    Baniyatar
3    Manamaiju
Name: address, dtype: object

In [50]:
df.loc[[1,2], "first_name"]

1    Sabina
2    Devlal
Name: first_name, dtype: object

In [49]:
df.loc[[0, 1], "last_name"]

0    Shrestha
1    Maharjan
Name: last_name, dtype: object